/*
function cf_whichTransitionEvent(){ 
	var t; 
	var el = document.createElement('fakeelement'); 
	var transitions = { 
		'transition':'transitionEnd', 
		'OTransition':'oTransitionEnd', 
		'MSTransition':'msTransitionEnd', 
		'MozTransition':'transitionend', 
		'WebkitTransition':'webkitTransitionEnd' 
	}  
	for(t in transitions){ 
		if( el.style[t] !== undefined ){ 
			return transitions[t]; 
		} 
	} 
}
*/


function validate(evt) {
  var theEvent = evt || window.event;
  var key = theEvent.keyCode || theEvent.which;
  key = String.fromCharCode( key );
  var regex = /[0-9]|\./;
  if( !regex.test(key) ) {
    theEvent.returnValue = false;
    if(theEvent.preventDefault) theEvent.preventDefault();
  }
}

function getDistinctRandomIntForArray(array, range){
   var n = Math.floor((Math.random() * range));
   if(array.indexOf(n) == -1){        
    return n; 
   } else {
    return getDistinctRandomIntForArray(array, range); 
   }
}

function generateArrayOfRandomInts(count, range) {
   var array = []; 
   for (i=0; i<count; ++i){
    array[i] = getDistinctRandomIntForArray(array, range);
   };
   return array; 
}



function MakeArray(n){
	this.length=n;
}

function DIM(dimx,dimy){
	var i;
	var myArray = new Array(dimy);
	for (i=0; i<=dimx; i++) myArray[i] = new Array(dimx);
	return myArray;
}


function getQuestion(NUM,ntaku) {

	var q=new MakeArray(NUM);  
	var s=new DIM(NUM,ntaku);    

	
	q[1]="渡航";
	s[1][1]="とこう";
	s[1][2]="とうご";
	s[1][3]="どうほう";
	s[1][4]="どこう";
	
	q[2]="無念";
	s[2][1]="むねん";
	s[2][2]="ぶにん";
	s[2][3]="もうねん";
	s[2][4]="もうねい";

	q[3]="養生";
	s[3][1]="ようじょう";
	s[3][2]="ようせい";
	s[3][3]="よしょう";
	s[3][4]="よせい";
	
	q[4]="文言";
	s[4][1]="もんごん";
	s[4][2]="ぶんいん";
	s[4][3]="げんぶん";
	s[4][4]="もんげん";
	
	q[5]="尻尾";
	s[5][1]="しっぽ";
	s[5][2]="きゅうみ";
	s[5][3]="しりみ";
	s[5][4]="きゅうび";
	
	q[6]="失せる";
	s[6][1]="うせる";
	s[6][2]="あせる";
	s[6][3]="まかせる";
	s[6][4]="しょわせる";
	
	q[7]="淋しい";
	s[7][1]="さびしい";
	s[7][2]="したしい";
	s[7][3]="さかしい";
	s[7][4]="くやしい";
	
	q[8]="悪戯";
	s[8][1]="いたずら";
	s[8][2]="あくげき";
	s[8][3]="いしづき";
	s[8][4]="あくへい";
	
	q[9]="除染";
	s[9][1]="じょせん";
	s[9][2]="よしん";
	s[9][3]="よせん";
	s[9][4]="じょしん";
		
	q[10]="推薦";
	s[10][1]="すいせん";
	s[10][2]="たいせん";
	s[10][3]="すいしん";
	s[10][4]="たいしん";
	
	q[11]="呷る";
	s[11][1]="あおる";
	s[11][2]="うなる";
	s[11][3]="すする";
	s[11][4]="しかる";
	
	q[12]="挑む";
	s[12][1]="いどむ";
	s[12][2]="のぞむ";
	s[12][3]="はげむ";
	s[12][4]="にらむ";
	
	q[13]="隣";
	s[13][1]="となり";
	s[13][2]="うろこ";
	s[13][3]="いなり";
	s[13][4]="とかく";
	
	q[14]="素性";
	s[14][1]="すじょう";
	s[14][2]="そうせい";
	s[14][3]="すせい";
	s[14][4]="そうじょう";
	
	q[15]="破廉恥";
	s[15][1]="はれんち";
	s[15][2]="ほりんじ";
	s[15][3]="はりんじ";
	s[15][4]="はりんち";
	
	q[16]="顎";
	s[16][1]="あご";
	s[16][2]="ひたい";
	s[16][3]="きば";
	s[16][4]="ほほ";
	
	q[17]="憤慨";
	s[17][1]="ふんがい";
	s[17][2]="ぱんかい";
	s[17][3]="ばんがい";
	s[17][4]="ふんけい";
	
	q[18]="小児";
	s[18][1]="しょうに";
	s[18][2]="こじ";
	s[18][3]="こうじ";
	s[18][4]="しょうち";
	
	q[19]="乞食";
	s[19][1]="こじき";
	s[19][2]="こいき";
	s[19][3]="しょうしょく";
	s[19][4]="けいしょく";
	
	q[20]="繁華街";
	s[20][1]="はんかがい";
	s[20][2]="ひんこうかい";
	s[20][3]="はんわかい";
	s[20][4]="ひんかがい";
	
	q[21]="選択";
	s[21][1]="せんたく";
	s[21][2]="さんだく";
	s[21][3]="しんちゃく";
	s[21][4]="せんちゃく";
	
	q[22]="仏陀";
	s[22][1]="ぶつだ";
	s[22][2]="ふくと";
	s[22][3]="ふっとう";
	s[22][4]="ぶっとう";
	
	q[23]="純粋";
	s[23][1]="じゅんすい";
	s[23][2]="しゅんわく";
	s[23][3]="じゅんずい";
	s[23][4]="そんすい";
	
	q[24]="捉える";
	s[24][1]="とらえる";
	s[24][2]="つかまえる";
	s[24][3]="あしえる";
	s[24][4]="もりえる";
	
	q[25]="削減";
	s[25][1]="さくげん";
	s[25][2]="しょうげん";
	s[25][3]="さっけん";
	s[25][4]="しょくげん";
	
	q[26]="痴漢";
	s[26][1]="ちかん";
	s[26][2]="じかん";
	s[26][3]="しかん";
	s[26][4]="じがん";
	
	q[27]="新顔";
	s[27][1]="しんがお";
	s[27][2]="にいかお";
	s[27][3]="しんがん";
	s[27][4]="にいがん";
	
	q[28]="登録";
	s[28][1]="とうろく";
	s[28][2]="たんらく";
	s[28][3]="どうらく";
	s[28][4]="たんりょく";
	
	q[29]="配信";
	s[29][1]="はいしん";
	s[29][2]="ばいしん";
	s[29][3]="ぱいじん";
	s[29][4]="はいじん";
	
	q[30]="互角";
	s[30][1]="ごかく";
	s[30][2]="うがく";
	s[30][3]="ごがく";
	s[30][4]="こうこく";
	
	
	q[31]="追及";
	s[31][1]="ついきゅう";
	s[31][2]="つうじゅう";
	s[31][3]="ついきょう";
	s[31][4]="とうぎゅう";

	q[32]="拠点";
	s[32][1]="きょてん";
	s[32][2]="ごてん";
	s[32][3]="きょでん";
	s[32][4]="ごでん";

	q[33]="富裕層";
	s[33][1]="ふゆうそう";
	s[33][2]="ふよぞう";
	s[33][3]="ふようそう";
	s[33][4]="ふうゆぞう";

	q[34]="著しい";
	s[34][1]="いちじるしい";
	s[34][2]="うるわしい";
	s[34][3]="なげかわしい";
	s[34][4]="あさましい";

	q[35]="図星";
	s[35][1]="ずぼし";
	s[35][2]="とうせい";
	s[35][3]="ずせい";
	s[35][4]="とぼし";

	q[36]="砕ける";
	s[36][1]="くだける";
	s[36][2]="しらける";
	s[36][3]="けしかける";
	s[36][4]="とぼける";

	q[37]="手柄";
	s[37][1]="てがら";
	s[37][2]="しゅひ";
	s[37][3]="てけい";
	s[37][4]="しゅえ";

	q[38]="与党";
	s[38][1]="よとう";
	s[38][2]="やとう";
	s[38][3]="ようど";
	s[38][4]="やどう";

	q[39]="喧噪";
	s[39][1]="けんそう";
	s[39][2]="けんか";
	s[39][3]="せんそう";
	s[39][4]="せんちょう";

	q[40]="真似";
	s[40][1]="まね";
	s[40][2]="しんじ";
	s[40][3]="しんに";
	s[40][4]="まに";

	q[41]="覗く";
	s[41][1]="のぞく";
	s[41][2]="うめく";
	s[41][3]="ゆがく";
	s[41][4]="ゆらぐ";

	q[42]="徐々";
	s[42][1]="じょじょ";
	s[42][2]="そそ";
	s[42][3]="しょしょう";
	s[42][4]="ぎょぎょ";

	q[43]="噛む";
	s[43][1]="かむ";
	s[43][2]="はむ";
	s[43][3]="つかむ";
	s[43][4]="たのむ";

	q[44]="絶句";
	s[44][1]="ぜっく";
	s[44][2]="せっく";
	s[44][3]="ぜこく";
	s[44][4]="せっこ";

	q[45]="逆鱗";
	s[45][1]="げきりん";
	s[45][2]="げっきん";
	s[45][3]="げつろん";
	s[45][4]="けいろん";

	q[46]="兼ねる";
	s[46][1]="かねる";
	s[46][2]="まねる";
	s[46][3]="すねる";
	s[46][4]="つねる";

	q[47]="施錠";
	s[47][1]="せじょう";
	s[47][2]="してい";
	s[47][3]="せてい";
	s[47][4]="しじゅう";

	q[48]="流出";
	s[48][1]="りゅうしゅつ";
	s[48][2]="りしゅう";
	s[48][3]="りゅうで";
	s[48][4]="りしゅう";

	q[49]="備考";
	s[49][1]="びこう";
	s[49][2]="ひこう";
	s[49][3]="べいごう";
	s[49][4]="べいこう";

	q[50]="蹂躙";
	s[50][1]="じゅうりん";
	s[50][2]="ゆうしん";
	s[50][3]="ゆうじん";
	s[50][4]="じゅうにん";

	q[51]="惨状";
	s[51][1]="さんじょう";
	s[51][2]="ちんじょう";
	s[51][3]="さんぞう";
	s[51][4]="さんそう";

	q[52]="融資";
	s[52][1]="ゆうし";
	s[52][2]="よじ";
	s[52][3]="よし";
	s[52][4]="ゆうじ";

	q[53]="該当";
	s[53][1]="がいとう";
	s[53][2]="けいどう";
	s[53][3]="かいど";
	s[53][4]="がいと";

	q[54]="挟む";
	s[54][1]="はさむ";
	s[54][2]="せばむ";
	s[54][3]="いたむ";
	s[54][4]="はしむ";

	q[55]="悪態";
	s[55][1]="あくたい";
	s[55][2]="うだい";
	s[55][3]="あくだい";
	s[55][4]="おたい";

	q[56]="災害";
	s[56][1]="さいがい";
	s[56][2]="かがい";
	s[56][3]="がかい";
	s[56][4]="さいけい";

	q[57]="環境";
	s[57][1]="かんきょう";
	s[57][2]="がんきょう";
	s[57][3]="がんけん";
	s[57][4]="かんけい";

	q[58]="安否";
	s[58][1]="あんぴ";
	s[58][2]="おんひ";
	s[58][3]="あんひ";
	s[58][4]="あんひん";

	q[59]="迅速";
	s[59][1]="じんそく";
	s[59][2]="しんぞく";
	s[59][3]="じんさく";
	s[59][4]="しんさく";

	q[60]="管轄";
	s[60][1]="かんかつ";
	s[60][2]="くんがつ";
	s[60][3]="こんかつ";
	s[60][4]="かんくつ";

	
	q[61]="通帳";
	s[61][1]="つうちょう";
	s[61][2]="とうじょう";
	s[61][3]="とうちょう";
	s[61][4]="つうてい";

	q[62]="意識";
	s[62][1]="いしき";
	s[62][2]="いじき";
	s[62][3]="よしき";
	s[62][4]="よじき";

	q[63]="漏らす";
	s[63][1]="もらす";
	s[63][2]="くらす";
	s[63][3]="ちらす";
	s[63][4]="わらす";

	q[64]="債権";
	s[64][1]="さいけん";
	s[64][2]="ざいげん";
	s[64][3]="さいげん";
	s[64][4]="せっけん";

	q[65]="冴えない";
	s[65][1]="さえない";
	s[65][2]="みえない";
	s[65][3]="しえない";
	s[65][4]="そえない";

	q[66]="戒める";
	s[66][1]="いましめる";
	s[66][2]="あきらめる";
	s[66][3]="たかめる";
	s[66][4]="しらしめる";

	q[67]="貧乏";
	s[67][1]="びんぼう";
	s[67][2]="ひんこん";
	s[67][3]="ひんほう";
	s[67][4]="べんぼう";

	q[68]="閉塞";
	s[68][1]="へいそく";
	s[68][2]="はいさく";
	s[68][3]="へいさく";
	s[68][4]="へいさつ";

	q[69]="湧く";
	s[69][1]="わく";
	s[69][2]="うく";
	s[69][3]="ひく";
	s[69][4]="あく";

	q[70]="稟議";
	s[70][1]="りんぎ";
	s[70][2]="しんぎ";
	s[70][3]="はんぎ";
	s[70][4]="ばんぎ";

	q[71]="震源";
	s[71][1]="しんげん";
	s[71][2]="ざんきん";
	s[71][3]="じんけん";
	s[71][4]="ざんげん";

	q[72]="散乱";
	s[72][1]="さんらん";
	s[72][2]="しょうらん";
	s[72][3]="さんれい";
	s[72][4]="しょうれん";

	q[73]="躍る";
	s[73][1]="おどる";
	s[73][2]="ひかる";
	s[73][3]="あおる";
	s[73][4]="おさる";

	q[74]="瞼";
	s[74][1]="まぶた";
	s[74][2]="ひとみ";
	s[74][3]="かお";
	s[74][4]="ひたい";

	q[75]="爆弾";
	s[75][1]="ばくだん";
	s[75][2]="さくだん";
	s[75][3]="ばくたん";
	s[75][4]="さくたん";

	q[76]="馴染み";
	s[76][1]="なじみ";
	s[76][2]="ばしみ";
	s[76][3]="なそみ";
	s[76][4]="ばそみ";

	q[77]="開口";
	s[77][1]="かいこう";
	s[77][2]="がいく";
	s[77][3]="かいくう";
	s[77][4]="がいくう";

	q[78]="眼窩";
	s[78][1]="がんか";
	s[78][2]="めお";
	s[78][3]="めか";
	s[78][4]="がんお";

	q[79]="無造作";
	s[79][1]="むぞうさ";
	s[79][2]="ぶそうさく";
	s[79][3]="むささく";
	s[79][4]="ぶささく";

	q[80]="焦る";
	s[80][1]="あせる";
	s[80][2]="やける";
	s[80][3]="あじる";
	s[80][4]="まさる";

	q[81]="狼狽";
	s[81][1]="ろうばい";
	s[81][2]="らんはい";
	s[81][3]="ろうへい";
	s[81][4]="らいばい";

	q[82]="濡らす";
	s[82][1]="ぬらす";
	s[82][2]="へらす";
	s[82][3]="ねらす";
	s[82][4]="じらす";

	q[83]="隅";
	s[83][1]="すみ";
	s[83][2]="あみ";
	s[83][3]="つみ";
	s[83][4]="くみ";

	q[84]="断る";
	s[84][1]="ことわる";
	s[84][2]="きる";
	s[84][3]="あやめる";
	s[84][4]="わる";

	q[85]="誘う";
	s[85][1]="さそう";
	s[85][2]="さわう";
	s[85][3]="しこう";
	s[85][4]="よそう";

	q[86]="見当";
	s[86][1]="けんとう";
	s[86][2]="みあて";
	s[86][3]="みとう";
	s[86][4]="けんどう";

	q[87]="刹那";
	s[87][1]="せつな";
	s[87][2]="せなう";
	s[87][3]="せない";
	s[87][4]="せなつ";

	q[88]="証拠";
	s[88][1]="しょうこ";
	s[88][2]="じょうきょ";
	s[88][3]="しょうきょう";
	s[88][4]="しょこう";

	q[89]="瞳";
	s[89][1]="ひとみ";
	s[89][2]="なまこ";
	s[89][3]="まこと";
	s[89][4]="みとり";

	q[90]="原発";
	s[90][1]="げんぱつ";
	s[90][2]="げんはっ";
	s[90][3]="はらはつ";
	s[90][4]="はらばつ";

	// Check04
	q[91]="対価";
	s[91][1]="たいか";
	s[91][2]="だいが";
	s[91][3]="といが";
	s[91][4]="だいか";

	q[92]="否定";
	s[92][1]="ひてい";
	s[92][2]="ぴてい";
	s[92][3]="ひんて";
	s[92][4]="ひでい";

	q[93]="派手な";
	s[93][1]="はでな";
	s[93][2]="はいてな";
	s[93][3]="はしゅな";
	s[93][4]="はてな";

	q[94]="君主";
	s[94][1]="くんしゅ";
	s[94][2]="かんしゅ";
	s[94][3]="ぐんしゅう";
	s[94][4]="かんぬし";

	q[95]="怯える";
	s[95][1]="おびえる";
	s[95][2]="ととのえる";
	s[95][3]="ふるえる";
	s[95][4]="かまえる";

	q[96]="寝不足";
	s[96][1]="ねぶそく";
	s[96][2]="ねふそう";
	s[96][3]="しんぶそく";
	s[96][4]="しんふぞう";

	q[97]="叱咤";
	s[97][1]="しった ";
	s[97][2]="じっど";
	s[97][3]="じった";
	s[97][4]="しっか";

	q[98]="輸送";
	s[98][1]="ゆそう";
	s[98][2]="ゆうそう";
	s[98][3]="しゅそう";
	s[98][4]="しゅうそ";

	q[99]="葉書";
	s[99][1]="はがき";
	s[99][2]="はしょ";
	s[99][3]="ようぞ";
	s[99][4]="しょうそ";

	q[100]="絵空事";
	s[100][1]="えそらごと";
	s[100][2]="かいくうし";
	s[100][3]="えくうじ";
	s[100][4]="えそらじ";

	q[101]="代償";
	s[101][1]="だいしょう";
	s[101][2]="たいしょ";
	s[101][3]="だいそう";
	s[101][4]="だいそう";

	q[102]="餌";
	s[102][1]="えさ";
	s[102][2]="さえ";
	s[102][3]="さい";
	s[102][4]="しい";

	q[103]="閲覧";
	s[103][1]="えつらん";
	s[103][2]="ゆつらん";
	s[103][3]="えつれん";
	s[103][4]="ゆつれん";

	q[104]="粉飾";
	s[104][1]="ふんしょく";
	s[104][2]="はんしょく";
	s[104][3]="しゅんしく";
	s[104][4]="ふんしく";

	q[105]="看過";
	s[105][1]="かんか";
	s[105][2]="みか";
	s[105][3]="かんがん";
	s[105][4]="みんか";

	q[106]="俗語";
	s[106][1]="ぞくご";
	s[106][2]="そくゆ";
	s[106][3]="そくご";
	s[106][4]="こくご";

	q[107]="統括";
	s[107][1]="とうかつ";
	s[107][2]="とんかつ";
	s[107][3]="とうくう";
	s[107][4]="とうくつ";

	q[108]="笑顔";
	s[108][1]="えがお";
	s[108][2]="しょうかお";
	s[108][3]="えいかお";
	s[108][4]="しょうかん";

	q[109]="面接";
	s[109][1]="めんせつ";
	s[109][2]="みんじつ";
	s[109][3]="めんじつ";
	s[109][4]="みんせつ";

	q[110]="名物";
	s[110][1]="めいぶつ";
	s[110][2]="なもの";
	s[110][3]="めいおん";
	s[110][4]="なぶつ";

	q[111]="唾";
	s[111][1]="つば";
	s[111][2]="くそ";
	s[111][3]="みず";
	s[111][4]="つみ";

	q[112]="範疇";
	s[112][1]="はんちゅう";
	s[112][2]="はんすう";
	s[112][3]="はんそう";
	s[112][4]="はんしゅう";

	q[113]="激昂";
	s[113][1]="げきこう";
	s[113][2]="げっおう";
	s[113][3]="ぎんこう";
	s[113][4]="きんごう";

	q[114]="鮮明";
	s[114][1]="せんめい";
	s[114][2]="しんめん";
	s[114][3]="せいめん";
	s[114][4]="しんめい";

	q[115]="噂";
	s[115][1]="うわさ";
	s[115][2]="たる";
	s[115][3]="はなし";
	s[115][4]="つぼ";

	q[116]="名簿";
	s[116][1]="めいぼ";
	s[116][2]="なほう";
	s[116][3]="なぼ";
	s[116][4]="めいぶ";

	q[117]="頂戴";
	s[117][1]="ちょうだい";
	s[117][2]="ていだい";
	s[117][3]="ちょたい";
	s[117][4]="ちょうてい";

	q[118]="一抹";
	s[118][1]="いちまつ";
	s[118][2]="いちみ";
	s[118][3]="いってい";
	s[118][4]="いっかい";

	q[119]="差出人";
	s[119][1]="さしだしにん";
	s[119][2]="さしゅつじん";
	s[119][3]="さいでにん";
	s[119][4]="さしでじん";

	q[120]="蠟燭";
	s[120][1]="ろうそく";
	s[120][2]="りょうじょく";
	s[120][3]="りょうだく";
	s[120][4]="ろうだく";
	
	//Check 05
	
	q[121]="糾弾";
	s[121][1]="きゅうだん";
	s[121][2]="きょうたん";
	s[121][3]="きゅうたん";
	s[121][4]="ぎゅうだん";

	q[122]="発揮";
	s[122][1]="はっき";
	s[122][2]="ほっき";
	s[122][3]="はつぎ";
	s[122][4]="ほつぎ";

	q[123]="棒";
	s[123][1]="ぼう";
	s[123][2]="ばん";
	s[123][3]="ぱん";
	s[123][4]="もう";

	q[124]="感情";
	s[124][1]="かんじょう";
	s[124][2]="がんしょう";
	s[124][3]="かんちょう";
	s[124][4]="がんじょう";

	q[125]="暴君";
	s[125][1]="ぼうくん";
	s[125][2]="ばくくん";
	s[125][3]="ぼうかん";
	s[125][4]="ばっかん";

	q[126]="断言";
	s[126][1]="だんげん";
	s[126][2]="たんけん";
	s[126][3]="だんいん";
	s[126][4]="たんごん";

	q[127]="体制";
	s[127][1]="たいせい";
	s[127][2]="だせせい";
	s[127][3]="だいせい";
	s[127][4]="たいぜい";

	q[128]="体裁";
	s[128][1]="ていさい";
	s[128][2]="たいざい";
	s[128][3]="でいすい";
	s[128][4]="ていそい";

	q[129]="訂正";
	s[129][1]="ていせい";
	s[129][2]="ていさい";
	s[129][3]="でんさい";
	s[129][4]="でいしょう";

	q[130]="評価";
	s[130][1]="ひょうか";
	s[130][2]="ひんか";
	s[130][3]="ひょうご";
	s[130][4]="はんか";

	q[131]="口調";
	s[131][1]="くちょう";
	s[131][2]="ちくらべ";
	s[131][3]="くちらべ";
	s[131][4]="こうちょ";

	q[132]="仇";
	s[132][1]="かたき";
	s[132][2]="たたき";
	s[132][3]="かたな";
	s[132][4]="なかた";

	q[133]="鈍い";
	s[133][1]="にぶい";
	s[133][2]="じゅんい";
	s[133][3]="かたい";
	s[133][4]="しぶい";

	q[134]="棚";
	s[134][1]="たな";
	s[134][2]="たん";
	s[134][3]="だん";
	s[134][4]="なた";

	q[135]="挽回";
	s[135][1]="ばんかい";
	s[135][2]="めんかい";
	s[135][3]="まんがい";
	s[135][4]="めんがい";

	q[136]="誤認";
	s[136][1]="ごにん";
	s[136][2]="おねん";
	s[136][3]="おにん";
	s[136][4]="ごねん";

	q[137]="反撃";
	s[137][1]="はんげき";
	s[137][2]="はんけつ";
	s[137][3]="がんけぎ";
	s[137][4]="しんげき";

	q[138]="挑発";
	s[138][1]="ちょうはつ";
	s[138][2]="ちょうばつ";
	s[138][3]="ちゅうはつ";
	s[138][4]="ちゅうばつ";

	q[139]="侮辱";
	s[139][1]="ぶじょく";
	s[139][2]="もうよく";
	s[139][3]="ぶよく";
	s[139][4]="もじょく";

	q[140]="遮る";
	s[140][1]="さえぎる";
	s[140][2]="くつがえる";
	s[140][3]="みなぎる";
	s[140][4]="さえわたる";

	q[141]="喧嘩";
	s[141][1]="けんか";
	s[141][2]="ひんか";
	s[141][3]="げんか";
	s[141][4]="ひゅうが";

	q[142]="諦める";
	s[142][1]="あきらめる";
	s[142][2]="しめる";
	s[142][3]="したためる";
	s[142][4]="やめる";

	q[143]="持論";
	s[143][1]="じろん";
	s[143][2]="ちらん";
	s[143][3]="じらん";
	s[143][4]="ちろん";

	q[144]="蓋然性";
	s[144][1]="がいぜんせい";
	s[144][2]="かいせんぜい";
	s[144][3]="かんせいさい";
	s[144][4]="ごうぜんせい";

	q[145]="露呈";
	s[145][1]="ろてい";
	s[145][2]="ろけい";
	s[145][3]="ろちょう";
	s[145][4]="ろこう";

	q[146]="失格";
	s[146][1]="しっかく";
	s[146][2]="さっかく";
	s[146][3]="しつらく";
	s[146][4]="さくがく";

	q[147]="組織";
	s[147][1]="そしき";
	s[147][2]="じょうしき";
	s[147][3]="そじく";
	s[147][4]="じょうさく";

	q[148]="口応え";
	s[148][1]="くちごたえ";
	s[148][2]="こうおうえ";
	s[148][3]="くえんえ";
	s[148][4]="くちづたえ";

	q[149]="愕然";
	s[149][1]="がくぜん";
	s[149][2]="こうぜん";
	s[149][3]="とうぜん";
	s[149][4]="がいぜん";

	q[150]="届出";
	s[150][1]="とどけで";
	s[150][2]="けいしゅつ";
	s[150][3]="ゆしゅつ";
	s[150][4]="とどきで";
	
	
	// Check 06
	
	q[151]="現職";
	s[151][1]="げんしょく";
	s[151][2]="いんしき";
	s[151][3]="げんしき";
	s[151][4]="げんしょう";

	q[152]="補助";
	s[152][1]="ほじょ";
	s[152][2]="ぼうじょう";
	s[152][3]="ほじょう";
	s[152][4]="ぼじょう";

	q[153]="尽力";
	s[153][1]="じんりょく";
	s[153][2]="ちんりく";
	s[153][3]="じんりく";
	s[153][4]="ちんりょく";

	q[154]="若手";
	s[154][1]="わかて";
	s[154][2]="じゃくて";
	s[154][3]="わって";
	s[154][4]="じゃくしゅう";

	q[155]="度胸";
	s[155][1]="どきょう";
	s[155][2]="どうこう";
	s[155][3]="どうきゅう";
	s[155][4]="どきゅう";

	q[156]="謙譲";
	s[156][1]="けんじょう";
	s[156][2]="きんじょう";
	s[156][3]="けんにょう";
	s[156][4]="きんちょう";

	q[157]="曖昧";
	s[157][1]="あいまい";
	s[157][2]="あまい";
	s[157][3]="あいみ";
	s[157][4]="あんまい";

	q[158]="添える";
	s[158][1]="そえる";
	s[158][2]="なえる";
	s[158][3]="もえる";
	s[158][4]="こえる";

	q[159]="無精";
	s[159][1]="ぶしょう";
	s[159][2]="むちょう";
	s[159][3]="ぶちょう";
	s[159][4]="むそう";

	q[160]="既に";
	s[160][1]="すでに";
	s[160][2]="ゆえに";
	s[160][3]="すきに";
	s[160][4]="ゆきに";

	q[161]="弔辞";
	s[161][1]="ちょうじ";
	s[161][2]="けいじ";
	s[161][3]="きゅうち";
	s[161][4]="けいち";

	q[162]="余剰";
	s[162][1]="よじょう";
	s[162][2]="ゆじょう";
	s[162][3]="よちょう";
	s[162][4]="ゆうじょ";

	q[163]="悉く";
	s[163][1]="ことごとく";
	s[163][2]="はげしく";
	s[163][3]="たかだかく";
	s[163][4]="まさしく";

	q[164]="刮目";
	s[164][1]="かつもく";
	s[164][2]="りめ";
	s[164][3]="せつもく";
	s[164][4]="しため";

	q[165]="貴重な";
	s[165][1]="きちょうな";
	s[165][2]="きじゅうな";
	s[165][3]="きしょうな";
	s[165][4]="きちゅうな";

	q[166]="淫らな";
	s[166][1]="みだらな";
	s[166][2]="いやらな";
	s[166][3]="みしらな";
	s[166][4]="いんらな";

	q[167]="潔白";
	s[167][1]="けっぱく";
	s[167][2]="けつばく";
	s[167][3]="けっはく";
	s[167][4]="きっぱく";

	q[168]="疑義";
	s[168][1]="ぎぎ";
	s[168][2]="いじ";
	s[168][3]="いぎ";
	s[168][4]="ぎい";

	q[169]="疲弊";
	s[169][1]="ひへい";
	s[169][2]="へへい";
	s[169][3]="へひい";
	s[169][4]="ひいへ";

	q[170]="嫡出子";
	s[170][1]="ちゃくしゅつし";
	s[170][2]="てきしゅつじ";
	s[170][3]="てきしゅつし";
	s[170][4]="ちょくでし";

	q[171]="人手";
	s[171][1]="ひとで";
	s[171][2]="にんしょう";
	s[171][3]="にしゅう";
	s[171][4]="ひんで";

	q[172]="模索";
	s[172][1]="もさく";
	s[172][2]="もうそう";
	s[172][3]="もそう";
	s[172][4]="まさく";

	q[173]="務める";
	s[173][1]="つとめる";
	s[173][2]="からめる";
	s[173][3]="はじめる";
	s[173][4]="まとめる";

	q[174]="危機";
	s[174][1]="きき";
	s[174][2]="ぎぎ";
	s[174][3]="きぎ";
	s[174][4]="ぎき";

	q[175]="進境";
	s[175][1]="しんきょう";
	s[175][2]="しんぎゅう";
	s[175][3]="さんきょう";
	s[175][4]="さんぎゅう";

	q[176]="強烈";
	s[176][1]="きょうれつ";
	s[176][2]="ごうれつ";
	s[176][3]="ぎょうれつ";
	s[176][4]="きゅうれつ";

	q[177]="哲学";
	s[177][1]="てつがく";
	s[177][2]="てっかく";
	s[177][3]="てちかく";
	s[177][4]="てんがく";

	q[178]="滑る";
	s[178][1]="すべる";
	s[178][2]="はまる";
	s[178][3]="くべる";
	s[178][4]="すねる";

	q[179]="遠征";
	s[179][1]="えんせい";
	s[179][2]="ゆんせい";
	s[179][3]="えんぜん";
	s[179][4]="ゆんぜん";

	q[180]="躊躇";
	s[180][1]="ちゅうちょ";
	s[180][2]="ちゅちょう";
	s[180][3]="ちょうちゅ";
	s[180][4]="ちゅうちゅ";
	
	// Check 7

	q[181]="銃撃";
	s[181][1]="じゅうげき";
	s[181][2]="ちょうけき";
	s[181][3]="ちょうげき";
	s[181][4]="じゅうがん";

	q[182]="守秘";
	s[182][1]="しゅひ";
	s[182][2]="じゅび";
	s[182][3]="しゅうひ";
	s[182][4]="じゅぴ";

	q[183]="軒並み";
	s[183][1]="のきなみ";
	s[183][2]="けんなみ";
	s[183][3]="おきあみ";
	s[183][4]="げんあみ";

	q[184]="虫歯";
	s[184][1]="むしば";
	s[184][2]="ちゅうが";
	s[184][3]="ちゅうし";
	s[184][4]="むしし";

	q[185]="取引";
	s[185][1]="とりひき";
	s[185][2]="しゅいん";
	s[185][3]="しゅやん";
	s[185][4]="とびりき";

	q[186]="偽装";
	s[186][1]="ぎそう";
	s[186][2]="いしょう";
	s[186][3]="ぎじょう";
	s[186][4]="いそう";

	q[187]="提要";
	s[187][1]="ていよう";
	s[187][2]="たいよう";
	s[187][3]="ていゆう";
	s[187][4]="たいゆう";

	q[188]="削減";
	s[188][1]="さくげん";
	s[188][2]="さっけん";
	s[188][3]="さくがん";
	s[188][4]="さっがん";

	q[189]="緊迫";
	s[189][1]="きんぱく";
	s[189][2]="ぎんはく";
	s[189][3]="きんほう";
	s[189][4]="ぎんほう";

	q[190]="追悼";
	s[190][1]="ついとう";
	s[190][2]="ちょうどう";
	s[190][3]="ちょうとう";
	s[190][4]="ついどう";

	q[191]="冗談";
	s[191][1]="じょうだん";
	s[191][2]="ちょうたん";
	s[191][3]="しょうたん";
	s[191][4]="じょうがん";

	q[192]="示唆";
	s[192][1]="しさ";
	s[192][2]="じそう";
	s[192][3]="じさ";
	s[192][4]="しそう";

	q[193]="盛んな";
	s[193][1]="さかんな";
	s[193][2]="きけんな";
	s[193][3]="いかんな";
	s[193][4]="たかんな";

	q[194]="行政";
	s[194][1]="ぎょうせい";
	s[194][2]="きょうぜい";
	s[194][3]="きょうぜい";
	s[194][4]="こうしょう";

	q[195]="再建";
	s[195][1]="さいけん";
	s[195][2]="さいぎん";
	s[195][3]="さいげん";
	s[195][4]="さいこう";

	q[196]="汚染";
	s[196][1]="おせん";
	s[196][2]="おえん";
	s[196][3]="うせん";
	s[196][4]="うえん";

	q[197]="募集";
	s[197][1]="ぼしゅう";
	s[197][2]="もうしゅう";
	s[197][3]="ぼうしゅう";
	s[197][4]="もしゅう";

	q[198]="激高";
	s[198][1]="げっこう";
	s[198][2]="げきかん";
	s[198][3]="けっごう";
	s[198][4]="げいこう";

	q[199]="懸念";
	s[199][1]="けねん";
	s[199][2]="ひんねん";
	s[199][3]="けにん";
	s[199][4]="ひねん";

	q[200]="慎重";
	s[200][1]="しんちょう";
	s[200][2]="しんじゅう";
	s[200][3]="ちんちゅう";
	s[200][4]="ちんじゅう";

	q[201]="誓約";
	s[201][1]="せいやく";
	s[201][2]="さいよく";
	s[201][3]="せいよく";
	s[201][4]="さいやく";

	q[202]="専属";
	s[202][1]="せんぞく";
	s[202][2]="せんさく";
	s[202][3]="さんぞく";
	s[202][4]="さんさく";

	q[203]="解釈";
	s[203][1]="かいしゃく";
	s[203][2]="がいさく";
	s[203][3]="がいしゃく";
	s[203][4]="けいさく";

	q[204]="紛争";
	s[204][1]="ふんそう";
	s[204][2]="はんぞう";
	s[204][3]="ふんぞう";
	s[204][4]="はんそう";

	q[205]="芽";
	s[205][1]="め";
	s[205][2]="が";
	s[205][3]="は";
	s[205][4]="み";

	q[206]="観点";
	s[206][1]="かんてん";
	s[206][2]="がんでん";
	s[206][3]="こうてん";
	s[206][4]="がんてん";

	q[207]="統一";
	s[207][1]="とういつ";
	s[207][2]="とんいつ";
	s[207][3]="とういじ";
	s[207][4]="どういち";

	q[208]="見極める";
	s[208][1]="みきわめる";
	s[208][2]="けんぎめる";
	s[208][3]="みきょくめる";
	s[208][4]="けんきめる";

	q[209]="配布";
	s[209][1]="はいふ";
	s[209][2]="ほうふ";
	s[209][3]="はんぷ";
	s[209][4]="ほうぶ";

	q[210]="漏洩";
	s[210][1]="ろうせつ";
	s[210][2]="りゅうせつ";
	s[210][3]="ろうわい";
	s[210][4]="りゅうえい";

	

	// check 08
	q[211]="削る";
	s[211][1]="けずる";
	s[211][2]="やせる";
	s[211][3]="けむる";
	s[211][4]="ずれる";

	q[212]="専属";
	s[212][1]="せんぞく";
	s[212][2]="ぜんそく";
	s[212][3]="そんじょく";
	s[212][4]="せんじょく";

	q[213]="潜る";
	s[213][1]="もぐる";
	s[213][2]="わたる";
	s[213][3]="しずる";
	s[213][4]="ぐぐる";

	q[214]="頻繁";
	s[214][1]="ひんぱん";
	s[214][2]="はんばん";
	s[214][3]="びんぱん";
	s[214][4]="ひんばん";

	q[215]="修繕";
	s[215][1]="しゅうぜん";
	s[215][2]="そうぜん";
	s[215][3]="しょうせん";
	s[215][4]="そうせん";

	q[216]="有用";
	s[216][1]="ゆうよう";
	s[216][2]="ようよう";
	s[216][3]="ゆうゆう";
	s[216][4]="ようよう";

	q[217]="唐突";
	s[217][1]="とうとつ";
	s[217][2]="とうだつ";
	s[217][3]="とんだつ";
	s[217][4]="とんこつ";

	q[218]="垂れる";
	s[218][1]="たれる";
	s[218][2]="もれる";
	s[218][3]="すれる";
	s[218][4]="とれる";

	q[219]="葛藤";
	s[219][1]="かっとう";
	s[219][2]="こっとう";
	s[219][3]="かったん";
	s[219][4]="こっとん";

	q[220]="鳥取県";
	s[220][1]="とっとりけん";
	s[220][2]="とりとりけん";
	s[220][3]="とんとりげん";
	s[220][4]="とりどりけん";

	q[221]="上品";
	s[221][1]="じょうひん";
	s[221][2]="じゅうびん";
	s[221][3]="しゅうひん";
	s[221][4]="じゅうひん";

	q[222]="合戦";
	s[222][1]="かっせん";
	s[222][2]="ごうじん";
	s[222][3]="こうちん";
	s[222][4]="かっさん";

	q[223]="無様";
	s[223][1]="ぶざま";
	s[223][2]="むよう";
	s[223][3]="ぶよう";
	s[223][4]="むさま";

	q[224]="存在";
	s[224][1]="そんざい";
	s[224][2]="つんぞい";
	s[224][3]="つんさい";
	s[224][4]="ぞんざい";

	q[225]="緊密";
	s[225][1]="きんみつ";
	s[225][2]="だんみつ";
	s[225][3]="ぎんまつ";
	s[225][4]="きんまつ";

	q[226]="恒例";
	s[226][1]="こうれい";
	s[226][2]="かんれい";
	s[226][3]="こうらい";
	s[226][4]="かんらい";

	q[227]="遠慮";
	s[227][1]="えんりょ";
	s[227][2]="ゆんろう";
	s[227][3]="えんろう";
	s[227][4]="ゆりょう";

	q[228]="蜘蛛";
	s[228][1]="くも";
	s[228][2]="ししゅう";
	s[228][3]="じちゅう";
	s[228][4]="ぐぼ";

	q[229]="椅子";
	s[229][1]="いす";
	s[229][2]="きす";
	s[229][3]="きし";
	s[229][4]="いじ";

	q[230]="恨み";
	s[230][1]="うらみ";
	s[230][2]="ねたみ";
	s[230][3]="そねみ";
	s[230][4]="あまみ";

	q[231]="依存";
	s[231][1]="いそん";
	s[231][2]="いんぞん";
	s[231][3]="ぞいん";
	s[231][4]="いじょう";

	q[232]="識別";
	s[232][1]="しきべつ";
	s[232][2]="しょくばつ";
	s[232][3]="しょくべく";
	s[232][4]="しきばつ";

	q[233]="大晦日";
	s[233][1]="おおみそか";
	s[233][2]="だいかいじ";
	s[233][3]="おおかいじ";
	s[233][4]="おみそかひ";

	q[234]="答弁";
	s[234][1]="とうべん";
	s[234][2]="べんとう";
	s[234][3]="たっべん";
	s[234][4]="べんだつ";

	q[235]="屑";
	s[235][1]="くず";
	s[235][2]="こみ";
	s[235][3]="ちじ";
	s[235][4]="じり";

	q[236]="感謝";
	s[236][1]="かんしゃ";
	s[236][2]="がんしゃ";
	s[236][3]="かしゃん";
	s[236][4]="がんじゃ";

	q[237]="聡明";
	s[237][1]="そうめい";
	s[237][2]="しゅうめい";
	s[237][3]="そうまい";
	s[237][4]="しゅうまい";

	q[238]="国連";
	s[238][1]="こくれん";
	s[238][2]="ごくりん";
	s[238][3]="こぐりん";
	s[238][4]="ごくりょう";

	q[239]="署名";
	s[239][1]="しょめい";
	s[239][2]="ちょめい";
	s[239][3]="ちょうめ";
	s[239][4]="しゅうめ";

	q[240]="正真正銘";
	s[240][1]="しょうしんしょうめい";
	s[240][2]="せいじんせいめい";
	s[240][3]="まさままさめん";
	s[240][4]="しょうじせいめい";
	

	//check 09

	q[241]="嘆願";
	s[241][1]="たんがん";
	s[241][2]="だんがん";
	s[241][3]="だんかん";
	s[241][4]="たんゆん";

	q[242]="措置";
	s[242][1]="そち";
	s[242][2]="そうじ";
	s[242][3]="そうち";
	s[242][4]="しゃくち";

	q[243]="定める";
	s[243][1]="さだめる";
	s[243][2]="じょうめる";
	s[243][3]="ていめる";
	s[243][4]="ただめる";

	q[244]="案の定";
	s[244][1]="あんのじょう";
	s[244][2]="あんのさだ";
	s[244][3]="おんのじょう";
	s[244][4]="けんのしょう";

	q[245]="選定";
	s[245][1]="せんてい";
	s[245][2]="しんじょう";
	s[245][3]="さんでい";
	s[245][4]="さんじょう";

	q[246]="侵害";
	s[246][1]="しんがい";
	s[246][2]="ちんかい";
	s[246][3]="しんごい";
	s[246][4]="ちんごい";

	q[247]="鋭い";
	s[247][1]="するどい";
	s[247][2]="きびしい";
	s[247][3]="はげしい";
	s[247][4]="すがしい";

	q[248]="費やす";
	s[248][1]="ついやす";
	s[248][2]="いやす";
	s[248][3]="ひやす";
	s[248][4]="おこしやす";

	q[249]="組合";
	s[249][1]="くみあい";
	s[249][2]="そこう";
	s[249][3]="そうごう";
	s[249][4]="くみこう";

	q[250]="抽選";
	s[250][1]="ちゅうせん";
	s[250][2]="ゆうせん";
	s[250][3]="ちゅうしゅん";
	s[250][4]="ゆうしゅん";

	q[251]="熟成";
	s[251][1]="じゅくせい";
	s[251][2]="そくせい";
	s[251][3]="そくじゅう";
	s[251][4]="じゅくじょう";

	q[252]="精鋭";
	s[252][1]="せいえい";
	s[252][2]="じんえん";
	s[252][3]="しょうえい";
	s[252][4]="せいよい";

	q[253]="履く";
	s[253][1]="はく";
	s[253][2]="ぬく";
	s[253][3]="すく";
	s[253][4]="とく";

	q[254]="公務員";
	s[254][1]="こうむいん";
	s[254][2]="ごうむいん";
	s[254][3]="こんむいん";
	s[254][4]="こむういん";

	q[255]="視聴率";
	s[255][1]="しちょうりつ";
	s[255][2]="していそつ";
	s[255][3]="しちょうそつ";
	s[255][4]="じちょうそつ";

	q[256]="勘";
	s[256][1]="かん";
	s[256][2]="はむ";
	s[256][3]="がん";
	s[256][4]="たん";

	q[257]="淋しい";
	s[257][1]="さびしい";
	s[257][2]="ざみしい";
	s[257][3]="さぶしい";
	s[257][4]="ざましい";

	q[258]="沖縄県";
	s[258][1]="おきなわけん";
	s[258][2]="おぎなはげん";
	s[258][3]="うきなわけん";
	s[258][4]="うぎだはげん";

	q[259]="詫びる";
	s[259][1]="わびる";
	s[259][2]="あびる";
	s[259][3]="くびる";
	s[259][4]="ちびる";

	q[260]="極上";
	s[260][1]="ごくじょう";
	s[260][2]="きょくうえ";
	s[260][3]="きょうじょう";
	s[260][4]="ごっじょう";

	q[261]="単刀直入";
	s[261][1]="たんとうちょくにゅう";
	s[261][2]="だんどちょくじゅう";
	s[261][3]="たんどうじょくにゅう";
	s[261][4]="だんかたなじかいり";

	q[262]="貧乏";
	s[262][1]="びんぼう";
	s[262][2]="ひんきゅう";
	s[262][3]="はんぽう";
	s[262][4]="ぱんぽう";

	q[263]="身勝手";
	s[263][1]="みがって";
	s[263][2]="しんかっしゅ";
	s[263][3]="じんがっしゅ";
	s[263][4]="しんがって";

	q[264]="領空";
	s[264][1]="りょうくう";
	s[264][2]="りんくう";
	s[264][3]="りんくん";
	s[264][4]="りゅうぐう";

	q[265]="膝";
	s[265][1]="ひざ";
	s[265][2]="ぴざ";
	s[265][3]="びざ";
	s[265][4]="びさ";

	q[266]="次第";
	s[266][1]="しだい";
	s[266][2]="じてい";
	s[266][3]="しでい";
	s[266][4]="じだい";

	q[267]="笑止千万";
	s[267][1]="しょうしせんばん";
	s[267][2]="わらすせるすまん";
	s[267][3]="わらじちよろず";
	s[267][4]="しょうじせんまん";

	q[268]="覆す";
	s[268][1]="くつがえす";
	s[268][2]="うらがえす";
	s[268][3]="はきなおす";
	s[268][4]="はきかえす";

	q[269]="廃絶";
	s[269][1]="はいぜつ";
	s[269][2]="はいせつ";
	s[269][3]="ばいぜん";
	s[269][4]="ばいせつ";

	q[270]="羞恥";
	s[270][1]="しゅうち";
	s[270][2]="さち";
	s[270][3]="しょうしゅう";
	s[270][4]="しょうち";
	

	//check10

	q[271]="狙撃";
	s[271][1]="そげき";
	s[271][2]="ちょうげき";
	s[271][3]="さくげき";
	s[271][4]="そうけき";

	q[272]="容疑";
	s[272][1]="ようぎ";
	s[272][2]="ゆうぎ";
	s[272][3]="ゆうき";
	s[272][4]="よぎん";

	q[273]="出場";
	s[273][1]="しゅつじょう";
	s[273][2]="しゅっしょう";
	s[273][3]="すつじょう";
	s[273][4]="すっちょう";

	q[274]="自衛";
	s[274][1]="じえい";
	s[274][2]="ちわい";
	s[274][3]="じわい";
	s[274][4]="ちえい";

	q[275]="等しい";
	s[275][1]="ひとしい";
	s[275][2]="ただしい";
	s[275][3]="おなしい";
	s[275][4]="ひさしい";

	q[276]="唯一";
	s[276][1]="ゆいいつ";
	s[276][2]="ゆんいち";
	s[276][3]="わいいつ";
	s[276][4]="わいじち";

	q[277]="暗殺";
	s[277][1]="あんさつ";
	s[277][2]="あんざつ";
	s[277][3]="おうさつ";
	s[277][4]="おうざつ";

	q[278]="尽くす";
	s[278][1]="つくす";
	s[278][2]="ちくす";
	s[278][3]="づくす";
	s[278][4]="すくす";

	q[279]="背後";
	s[279][1]="はいご";
	s[279][2]="ぶいご";
	s[279][3]="ぶいこ";
	s[279][4]="はいこう";

	q[280]="平等";
	s[280][1]="びょうどう";
	s[280][2]="へいだん";
	s[280][3]="へんどう";
	s[280][4]="ぴょうどん";

	q[281]="極める";
	s[281][1]="きわめる";
	s[281][2]="きくめる";
	s[281][3]="あたためる";
	s[281][4]="ながめる";

	q[282]="分担";
	s[282][1]="ぶんたん";
	s[282][2]="ふんだん";
	s[282][3]="はんだん";
	s[282][4]="ばんたん";

	q[283]="普段";
	s[283][1]="ふだん";
	s[283][2]="ぶうたん";
	s[283][3]="ふうだん";
	s[283][4]="ふとん";

	q[284]="名誉";
	s[284][1]="めいよ";
	s[284][2]="めよう";
	s[284][3]="めいゆう";
	s[284][4]="めんゆ";

	q[285]="消耗";
	s[285][1]="しょうもう";
	s[285][2]="しゅうほう";
	s[285][3]="しょうほう";
	s[285][4]="しゅうぼう";

	q[286]="舞う";
	s[286][1]="まう";
	s[286][2]="おどう";
	s[286][3]="もう";
	s[286][4]="うたう";

	q[287]="掃除";
	s[287][1]="そうじ";
	s[287][2]="そうじょう";
	s[287][3]="そじょう";
	s[287][4]="そじい";

	q[288]="憲法";
	s[288][1]="けんぽう";
	s[288][2]="ひんぽん";
	s[288][3]="けんぶう";
	s[288][4]="ひんぽう";

	q[289]="補償";
	s[289][1]="ほしょう";
	s[289][2]="ぼうしょ";
	s[289][3]="ほうじょう";
	s[289][4]="ぼしょう";

	q[290]="処罰";
	s[290][1]="しょばつ";
	s[290][2]="しゅばつ";
	s[290][3]="しょぱつ";
	s[290][4]="しゅはつ";

	q[291]="棄損";
	s[291][1]="きそん";
	s[291][2]="へいそん";
	s[291][3]="かいすん";
	s[291][4]="きすん";

	q[292]="高騰";
	s[292][1]="こうとう";
	s[292][2]="ごうたん";
	s[292][3]="こうたん";
	s[292][4]="ごうどう";

	q[293]="会釈";
	s[293][1]="えしゃく";
	s[293][2]="かいじゃく";
	s[293][3]="えしょう";
	s[293][4]="かいさく";

	q[294]="誤解";
	s[294][1]="ごかい";
	s[294][2]="うがい";
	s[294][3]="こがい";
	s[294][4]="ごうかい";

	q[295]="苛立つ";
	s[295][1]="いらだつ";
	s[295][2]="かだつ";
	s[295][3]="こうたつ";
	s[295][4]="いさだつ";

	q[296]="損害";
	s[296][1]="そんがい";
	s[296][2]="さんかい";
	s[296][3]="さんがい";
	s[296][4]="そんはい";

	q[297]="構う";
	s[297][1]="かまう";
	s[297][2]="わらう";
	s[297][3]="さらう";
	s[297][4]="すまう";

	q[298]="突進";
	s[298][1]="とっしん";
	s[298][2]="たっしん";
	s[298][3]="たつじん";
	s[298][4]="どんじん";

	q[299]="酔う";
	s[299][1]="よう";
	s[299][2]="ゆう";
	s[299][3]="かう";
	s[299][4]="もう";

	q[300]="演歌";
	s[300][1]="えんか";
	s[300][2]="いんご";
	s[300][3]="いんか";
	s[300][4]="そうか";



	// check 11

	q[301]="外資";
	s[301][1]="がいし";
	s[301][2]="わいじ";
	s[301][3]="かいじ";
	s[301][4]="わしい";

	q[302]="代替";
	s[302][1]="だいたい";
	s[302][2]="たいたい";
	s[302][3]="だいだい";
	s[302][4]="たいだい";

	q[303]="挫傷";
	s[303][1]="ざしょう";
	s[303][2]="さじょう";
	s[303][3]="そうしょう";
	s[303][4]="そうじょう";

	q[304]="暇";
	s[304][1]="ひま";
	s[304][2]="まし";
	s[304][3]="ひな";
	s[304][4]="まま";

	q[305]="機嫌";
	s[305][1]="きげん";
	s[305][2]="げいん";
	s[305][3]="ぎいん";
	s[305][4]="きけん";

	q[306]="豪快な";
	s[306][1]="ごうかいな";
	s[306][2]="ほうがいな";
	s[306][3]="ごうはいな";
	s[306][4]="ほうはいな";

	q[307]="茨城県";
	s[307][1]="いばらきけん";
	s[307][2]="いはらぎけん";
	s[307][3]="いもしろけん";
	s[307][4]="いもぎけん";

	q[308]="途端";
	s[308][1]="とたん";
	s[308][2]="とうてん";
	s[308][3]="とだん";
	s[308][4]="とうどん";

	q[309]="事業";
	s[309][1]="じぎょう";
	s[309][2]="しぎょう";
	s[309][3]="じぎん";
	s[309][4]="しきん";

	q[310]="対峙";
	s[310][1]="たいじ";
	s[310][2]="だいち";
	s[310][3]="だいじ";
	s[310][4]="たいち";

	q[311]="欠場";
	s[311][1]="けつじょう";
	s[311][2]="けんちょう";
	s[311][3]="ひんじょう";
	s[311][4]="けつちょう";

	q[312]="地獄";
	s[312][1]="じごく";
	s[312][2]="ちよく";
	s[312][3]="じぎょく";
	s[312][4]="ちぎょく";

	q[313]="発足";
	s[313][1]="ほっそく";
	s[313][2]="はつあし";
	s[313][3]="はっさく";
	s[313][4]="はつぞく";

	q[314]="一律";
	s[314][1]="いちりつ";
	s[314][2]="いっそつ";
	s[314][3]="いちれつ";
	s[314][4]="いっりん";

	q[315]="頃";
	s[315][1]="ころ";
	s[315][2]="とん";
	s[315][3]="けん";
	s[315][4]="ごと";

	q[316]="嘲笑";
	s[316][1]="ちょうしょう";
	s[316][2]="ちょちょう";
	s[316][3]="しょちょう";
	s[316][4]="ちょうしゅう";

	q[317]="別荘";
	s[317][1]="べっそう";
	s[317][2]="ばっそう";
	s[317][3]="べつしょう";
	s[317][4]="ばつじょう";

	q[318]="横着";
	s[318][1]="おうちゃく";
	s[318][2]="ようちゃく";
	s[318][3]="おうちょう";
	s[318][4]="ようちょう";

	q[319]="普及";
	s[319][1]="ふきゅう";
	s[319][2]="きゅうく";
	s[319][3]="ふうきゅ";
	s[319][4]="ふっきゅう";

	q[320]="震える";
	s[320][1]="ふるえる";
	s[320][2]="しんえる";
	s[320][3]="ぶぶえる";
	s[320][4]="じんえる";

	q[321]="欧州";
	s[321][1]="おうしゅう";
	s[321][2]="あんしゅう";
	s[321][3]="おうす";
	s[321][4]="あんす";

	q[322]="痩せる";
	s[322][1]="やせる";
	s[322][2]="みせる";
	s[322][3]="あせる";
	s[322][4]="かせる";

	q[323]="唇";
	s[323][1]="くちびる";
	s[323][2]="くじぴる";
	s[323][3]="くじびき";
	s[323][4]="くちみる";

	q[324]="法律";
	s[324][1]="ほうりつ";
	s[324][2]="ほんりつ";
	s[324][3]="ほうろつ";
	s[324][4]="ほんろつ";

	q[325]="年賀状";
	s[325][1]="ねんがじょう";
	s[325][2]="ねんほちょう";
	s[325][3]="にんがじょう";
	s[325][4]="にんほちょう";

	q[326]="警戒";
	s[326][1]="けいかい";
	s[326][2]="けんがい";
	s[326][3]="げんけい";
	s[326][4]="げんかい";

	q[327]="無職";
	s[327][1]="むしょく";
	s[327][2]="もうしょく";
	s[327][3]="もうじく";
	s[327][4]="むじく";

	q[328]="交際";
	s[328][1]="こうさい";
	s[328][2]="こうざん";
	s[328][3]="ぎょうさい";
	s[328][4]="ぎょうざん";

	q[329]="逮捕";
	s[329][1]="たいほ";
	s[329][2]="たいぽ";
	s[329][3]="だいぼう";
	s[329][4]="だいぽう";

	q[330]="同棲";
	s[330][1]="どうせい";
	s[330][2]="とうさい";
	s[330][3]="どうさい";
	s[330][4]="とうせん";


	//check12

	q[331]="衆議院";
	s[331][1]="しゅうぎいん";
	s[331][2]="しゅんぎいん";
	s[331][3]="しょういいん";
	s[331][4]="しゅういいん";

	q[332]="善良";
	s[332][1]="ぜんりょう";
	s[332][2]="せんりょう";
	s[332][3]="しんりょう";
	s[332][4]="じんりょう";

	q[333]="屋外";
	s[333][1]="おくがい";
	s[333][2]="こがい";
	s[333][3]="うくかい";
	s[333][4]="うっかい";

	q[334]="待機";
	s[334][1]="たいき";
	s[334][2]="だいぎ";
	s[334][3]="どいぎ";
	s[334][4]="たいけい";

	q[335]="転居";
	s[335][1]="てんきょ";
	s[335][2]="てんこう";
	s[335][3]="てんぎょう";
	s[335][4]="でんぎょ";

	q[336]="迷惑";
	s[336][1]="めいわく";
	s[336][2]="わいまく";
	s[336][3]="まいわく";
	s[336][4]="まいまく";

	q[337]="従来";
	s[337][1]="じゅうらい";
	s[337][2]="しゅうらい";
	s[337][3]="ちゅうらい";
	s[337][4]="じょうらい";

	q[338]="根性";
	s[338][1]="こんじょう";
	s[338][2]="かんせい";
	s[338][3]="こんぜい";
	s[338][4]="かんじょう";

	q[339]="軽蔑";
	s[339][1]="けいべつ";
	s[339][2]="けいばつ";
	s[339][3]="けんまつ";
	s[339][4]="けいまつ";

	q[340]="醜い";
	s[340][1]="みにくい";
	s[340][2]="こにくい";
	s[340][3]="みさかい";
	s[340][4]="みみちい";

	q[341]="図々しい";
	s[341][1]="ずうずうしい";
	s[341][2]="ととしい";
	s[341][3]="はかはかしい";
	s[341][4]="ばかばかしい";

	q[342]="眉";
	s[342][1]="まゆ";
	s[342][2]="ゆま";
	s[342][3]="まめ";
	s[342][4]="めめ";

	q[343]="急伸";
	s[343][1]="きゅうしん";
	s[343][2]="ぎゅしん";
	s[343][3]="きゅうのび";
	s[343][4]="ぎゅのび";

	q[344]="郵便";
	s[344][1]="ゆうびん";
	s[344][2]="ていべん";
	s[344][3]="ようびん";
	s[344][4]="ようひん";

	q[345]="覚悟";
	s[345][1]="かくご";
	s[345][2]="ごくご";
	s[345][3]="かくが";
	s[345][4]="ごくが";

	q[346]="滋賀県";
	s[346][1]="しがけん";
	s[346][2]="ちかけん";
	s[346][3]="しかげん";
	s[346][4]="じがげん";

	q[347]="転勤";
	s[347][1]="てんきん";
	s[347][2]="でんぎん";
	s[347][3]="たんきん";
	s[347][4]="でんかん";

	q[348]="演奏";
	s[348][1]="えんそう";
	s[348][2]="いんしょう";
	s[348][3]="いんそう";
	s[348][4]="えんぞう";

	q[349]="金槌";
	s[349][1]="かなづち";
	s[349][2]="きんづち";
	s[349][3]="かんおい";
	s[349][4]="かなおい";

	q[350]="唸る";
	s[350][1]="うなる";
	s[350][2]="なめる";
	s[350][3]="うだる";
	s[350][4]="なおる";

	q[351]="幕開け";
	s[351][1]="まくあけ";
	s[351][2]="ばくかけ";
	s[351][3]="ばくあけ";
	s[351][4]="まくひらけ";

	q[352]="活躍";
	s[352][1]="かつやく";
	s[352][2]="うつよく";
	s[352][3]="かつよく";
	s[352][4]="かっゆく";

	q[353]="急逝";
	s[353][1]="きゅうせい";
	s[353][2]="きょうしょう";
	s[353][3]="きゅうしょう";
	s[353][4]="きっせい";

	q[354]="鉄道";
	s[354][1]="てつどう";
	s[354][2]="てっとう";
	s[354][3]="てちみち";
	s[354][4]="てちどう";

	q[355]="築く";
	s[355][1]="きずく";
	s[355][2]="きつく";
	s[355][3]="たかく";
	s[355][4]="とがく";

	q[356]="背広";
	s[356][1]="せびろ";
	s[356][2]="はいこう";
	s[356][3]="はいひろ";
	s[356][4]="せいひろ";

	q[357]="彫刻";
	s[357][1]="ちょうこく";
	s[357][2]="ちゅうかく";
	s[357][3]="ちゅうこく";
	s[357][4]="ちょうはく";

	q[358]="失脚";
	s[358][1]="しっきゃく";
	s[358][2]="しつかく";
	s[358][3]="しっかく";
	s[358][4]="さっきゃく";

	q[359]="変貌";
	s[359][1]="へんぼう";
	s[359][2]="ひんほう";
	s[359][3]="へんまう";
	s[359][4]="へんもう";

	q[360]="制止";
	s[360][1]="せいし";
	s[360][2]="さいじ";
	s[360][3]="せいじ";
	s[360][4]="さいち";


	//check 13

	q[361]="資金";
	s[361][1]="しきん";
	s[361][2]="ちぎん";
	s[361][3]="しぎん";
	s[361][4]="ずがん";

	q[362]="無断";
	s[362][1]="むだん";
	s[362][2]="ぶたん";
	s[362][3]="むうたん";
	s[362][4]="ぶうたん";

	q[363]="河川";
	s[363][1]="かせん";
	s[363][2]="こうせい";
	s[363][3]="かわがわ";
	s[363][4]="かか";

	q[364]="緩む";
	s[364][1]="ゆるむ";
	s[364][2]="たたむ";
	s[364][3]="ゆがむ";
	s[364][4]="たのむ";

	q[365]="湿度";
	s[365][1]="しつど";
	s[365][2]="しっど";
	s[365][3]="さっぷ";
	s[365][4]="さつど";

	q[366]="弦";
	s[366][1]="げん";
	s[366][2]="ゆう";
	s[366][3]="えん";
	s[366][4]="けん";

	q[367]="反る";
	s[367][1]="そる";
	s[367][2]="のる";
	s[367][3]="わる";
	s[367][4]="さる";

	q[368]="洪水";
	s[368][1]="こうずい";
	s[368][2]="こんすい";
	s[368][3]="ほうずい";
	s[368][4]="ほんずい";

	q[369]="世帯";
	s[369][1]="せたい";
	s[369][2]="さいだい";
	s[369][3]="せいたい";
	s[369][4]="さいてい";

	q[370]="暫く";
	s[370][1]="しばらく";
	s[370][2]="ようやく";
	s[370][3]="はたらく";
	s[370][4]="すばやく";

	q[371]="畦";
	s[371][1]="あぜ";
	s[371][2]="かえる";
	s[371][3]="はたけ";
	s[371][4]="つじ";

	q[372]="粉末";
	s[372][1]="ふんまつ";
	s[372][2]="はんみ";
	s[372][3]="ふんみ";
	s[372][4]="はんまつ";

	q[373]="欠食";
	s[373][1]="けっしょく";
	s[373][2]="けつしく";
	s[373][3]="けんしょう";
	s[373][4]="けんじき";

	q[374]="侮蔑";
	s[374][1]="ぶべつ";
	s[374][2]="びんべつ";
	s[374][3]="ぶんへつ";
	s[374][4]="ぶまつ";

	q[375]="捏造";
	s[375][1]="ねつぞう";
	s[375][2]="りつそう";
	s[375][3]="でっそう";
	s[375][4]="ねっぞう";

	q[376]="進捗";
	s[376][1]="しんちょく";
	s[376][2]="しんげき";
	s[376][3]="しんぽ";
	s[376][4]="しんしょう";

	q[377]="凹凸";
	s[377][1]="おうとつ";
	s[377][2]="とつおう";
	s[377][3]="ぼこぼこ";
	s[377][4]="でこでこ";

	q[378]="働く";
	s[378][1]="はたらく";
	s[378][2]="うごく";
	s[378][3]="はためく";
	s[378][4]="うめく";

	q[379]="暗算";
	s[379][1]="あんざん";
	s[379][2]="あんせん";
	s[379][3]="おんざん";
	s[379][4]="おんしゅん";

	q[380]="計測";
	s[380][1]="けいそく";
	s[380][2]="かいぞく";
	s[380][3]="けいさく";
	s[380][4]="かいさく";

	q[381]="畠";
	s[381][1]="はたけ";
	s[381][2]="ましろ";
	s[381][3]="おはな";
	s[381][4]="はだか";

	q[382]="鯨飲";
	s[382][1]="げいいん";
	s[382][2]="けんいん";
	s[382][3]="げんやん";
	s[382][4]="けんやん";

	q[383]="原因";
	s[383][1]="げんいん";
	s[383][2]="げいいん";
	s[383][3]="ゆんえん";
	s[383][4]="げんえん";

	q[384]="三重県";
	s[384][1]="みえけん";
	s[384][2]="さんじけん";
	s[384][3]="みわげん";
	s[384][4]="さんじゅうげん";

	q[385]="浄土";
	s[385][1]="じょうど";
	s[385][2]="そうと";
	s[385][3]="せいど";
	s[385][4]="しょうとう";

	q[386]="基督";
	s[386][1]="キリスト";
	s[386][2]="キストリ";
	s[386][3]="クリトス";
	s[386][4]="クライス";

	q[387]="技能";
	s[387][1]="ぎのう";
	s[387][2]="きなん";
	s[387][3]="ぎなん";
	s[387][4]="きぬう";

	q[388]="長年";
	s[388][1]="ながねん";
	s[388][2]="ながとせ";
	s[388][3]="ちょうにん";
	s[388][4]="じょうねん";

	q[389]="適切";
	s[389][1]="てきせつ";
	s[389][2]="てっせつ";
	s[389][3]="しきせつ";
	s[389][4]="せきせつ";

	q[390]="老舗";
	s[390][1]="しにせ";
	s[390][2]="せにし";
	s[390][3]="ろうぼう";
	s[390][4]="ろぼう";


	// check 14

	q[391]="似非";
	s[391][1]="えせ";
	s[391][2]="にせ";
	s[391][3]="にひ";
	s[391][4]="じじ";

	q[392]="俳句";
	s[392][1]="はいく";
	s[392][2]="ひぐい";
	s[392][3]="はくい";
	s[392][4]="ひぐ";

	q[393]="静謐";
	s[393][1]="せいひつ";
	s[393][2]="しょうび";
	s[393][3]="せいびつ";
	s[393][4]="じょうひん";

	q[394]="続柄";
	s[394][1]="つづきがら";
	s[394][2]="つぞくから";
	s[394][3]="ぞくから";
	s[394][4]="ぞくへい";

	q[395]="融通";
	s[395][1]="ゆうずう";
	s[395][2]="ようつう";
	s[395][3]="ゆうどう";
	s[395][4]="ゆうとん";

	q[396]="駆使";
	s[396][1]="くし";
	s[396][2]="こうし";
	s[396][3]="くさい";
	s[396][4]="こうさい";

	q[397]="等閑";
	s[397][1]="なおざり";
	s[397][2]="おざなり";
	s[397][3]="おいなり";
	s[397][4]="とんがん";

	q[398]="頁";
	s[398][1]="いう";
	s[398][2]="よく";
	s[398][3]="ペーズ";
	s[398][4]="ページ";

	q[399]="独楽";
	s[399][1]="こま";
	s[399][2]="とうらく";
	s[399][3]="どうらく";
	s[399][4]="ごまん";

	q[400]="生贄";
	s[400][1]="いけにえ";
	s[400][2]="いきげい";
	s[400][3]="せいしつ";
	s[400][4]="しゅしつ";

	q[401]="鮎";
	s[401][1]="あゆ";
	s[401][2]="ゆあ";
	s[401][3]="あい";
	s[401][4]="えい";

	q[402]="茶房";
	s[402][1]="さぼう";
	s[402][2]="ちゃぼう";
	s[402][3]="さふさ";
	s[402][4]="ちゃふざ";

	q[403]="馥郁";
	s[403][1]="ふくいく";
	s[403][2]="ふくゆく";
	s[403][3]="ふくよ";
	s[403][4]="こうふく";

	q[404]="若年化";
	s[404][1]="じゃくねんか";
	s[404][2]="やくねんか";
	s[404][3]="わかねんか";
	s[404][4]="じょくねんか";

	q[405]="幼稚な";
	s[405][1]="ようちな";
	s[405][2]="ゆうがな";
	s[405][3]="ようかな";
	s[405][4]="ゆうぢな";

	q[406]="砂利";
	s[406][1]="じゃり";
	s[406][2]="されい";
	s[406][3]="しゃきき";
	s[406][4]="さりい";

	q[407]="割烹";
	s[407][1]="かっぽう";
	s[407][2]="わりきょう";
	s[407][3]="かつひょう";
	s[407][4]="わりほう";

	q[408]="水母";
	s[408][1]="くらげ";
	s[408][2]="すいむ";
	s[408][3]="くちび";
	s[408][4]="しゅいぼ";

	q[409]="目処";
	s[409][1]="めど";
	s[409][2]="もくとう";
	s[409][3]="めしょ";
	s[409][4]="もくど";

	q[410]="奨励";
	s[410][1]="しょうれい";
	s[410][2]="じょうらい";
	s[410][3]="しょうらい";
	s[410][4]="じょうれき";

	q[411]="顰蹙";
	s[411][1]="ひんしゅく";
	s[411][2]="はんさく";
	s[411][3]="ひんせき";
	s[411][4]="びそく";

	q[412]="川柳";
	s[412][1]="せんりゅう";
	s[412][2]="かなやぎ";
	s[412][3]="せんろう";
	s[412][4]="かわやな";

	q[413]="杜撰";
	s[413][1]="ずさん";
	s[413][2]="すざん";
	s[413][3]="とせん";
	s[413][4]="どうさん";

	q[414]="曾孫";
	s[414][1]="ひまご";
	s[414][2]="そんそん";
	s[414][3]="ひまま";
	s[414][4]="そんしゅん";

	q[415]="迂闊";
	s[415][1]="うかつ";
	s[415][2]="ゆうかつ";
	s[415][3]="ゆかた";
	s[415][4]="うかた";

	q[416]="畢竟";
	s[416][1]="ひっきょう";
	s[416][2]="そつぎょう";
	s[416][3]="かきょう";
	s[416][4]="はつけい";

	q[417]="涎";
	s[417][1]="よだれ";
	s[417][2]="ゆたれ";
	s[417][3]="よだか";
	s[417][4]="ながれ";

	q[418]="鶴";
	s[418][1]="つる";
	s[418][2]="はと";
	s[418][3]="とり";
	s[418][4]="かめ";

	q[419]="黴";
	s[419][1]="かび";
	s[419][2]="けむり";
	s[419][3]="くすみ";
	s[419][4]="かに";

	q[420]="行灯";
	s[420][1]="あんどん";
	s[420][2]="こうとん";
	s[420][3]="はんどん";
	s[420][4]="ぎょうどう";

	
	q[421]="領域";
	s[421][1]="りょういき";
	s[421][2]="りんわく";
	s[421][3]="りょうわく";
	s[421][4]="りんいき";

	q[422]="遭遇";
	s[422][1]="そうぐう";
	s[422][2]="そぐう";
	s[422][3]="そゆ";
	s[422][4]="そうゆう";

	q[423]="厳重";
	s[423][1]="げんじゅう";
	s[423][2]="がんじゅう";
	s[423][3]="げんちょう";
	s[423][4]="がんじょう";

	q[424]="相次いで";
	s[424][1]="あいついで";
	s[424][2]="あいあいで";
	s[424][3]="そうついで";
	s[424][4]="そうじいで";

	q[425]="貢献";
	s[425][1]="こうけん";
	s[425][2]="けんこう";
	s[425][3]="こうひん";
	s[425][4]="こんごう";

	q[426]="旬";
	s[426][1]="しゅん";
	s[426][2]="ほう";
	s[426][3]="そう";
	s[426][4]="じん";

	q[427]="漁業";
	s[427][1]="ぎょぎょう";
	s[427][2]="よぎょう";
	s[427][3]="りょうぎょう";
	s[427][4]="りょぎょう";

	q[428]="漁師";
	s[428][1]="りょうし";
	s[428][2]="よし";
	s[428][3]="ぎょし";
	s[428][4]="りょし";


	q[429]="窮状";
	s[429][1]="きゅうじょう";
	s[429][2]="くじょう";
	s[429][3]="きょじょう";
	s[429][4]="こんじょう";


	q[430]="褒美";
	s[430][1]="ほうび";
	s[430][2]="ほみ";
	s[430][3]="ほうみ";
	s[430][4]="ぼうび";

	q[431]="奮発";
	s[431][1]="ふんぱつ";
	s[431][2]="ほうはつ";
	s[431][3]="ふんはつ";
	s[431][4]="はんばつ";


	q[432]="証拠";
	s[432][1]="しょうこ";
	s[432][2]="しょうきょ";
	s[432][3]="しょきょ";
	s[432][4]="しょこう";

	q[433]="母校";
	s[433][1]="ぼこう";
	s[433][2]="もごう";
	s[433][3]="ぼうこう";
	s[433][4]="もうこう";

	q[434]="臨む";
	s[434][1]="のぞむ";
	s[434][2]="ひるむ";
	s[434][3]="おがむ";
	s[434][4]="いどむ";


	q[435]="狙い";
	s[435][1]="ねらい";
	s[435][2]="うたがい";
	s[435][3]="わかい";
	s[435][4]="おもい";

	q[436]="出納";
	s[436][1]="すいとう";
	s[436][2]="でなつ";
	s[436][3]="しゅのう";
	s[436][4]="しゅなっ";


	q[437]="還暦";
	s[437][1]="かんれき";
	s[437][2]="わんれい";
	s[437][3]="かれき";
	s[437][4]="かんれい";


	q[438]="油絵";
	s[438][1]="あぶらえ";
	s[438][2]="ゆうえ";
	s[438][3]="あぶらかい";
	s[438][4]="ゆかい";

	q[439]="世辞";
	s[439][1]="せじ";
	s[439][2]="さいち";
	s[439][3]="せいじ";
	s[439][4]="さいじ";

	q[440]="嫉妬";
	s[440][1]="しっと";
	s[440][2]="しっとう";
	s[440][3]="しつどう";
	s[440][4]="しっせき";

	q[441]="凹凸";
	s[441][1]="おうとつ";
	s[441][2]="おうとう";
	s[441][3]="うえした";
	s[441][4]="のうたつ";

	q[442]="錆び";
	s[442][1]="さび";
	s[442][2]="せび";
	s[442][3]="しび";
	s[442][4]="しょうび";

	q[443]="鍛えて";
	s[443][1]="きたえて";
	s[443][2]="かたえて";
	s[443][3]="かきえて";
	s[443][4]="つたえて";

	q[444]="面";
	s[444][1]="つら";
	s[444][2]="みん";
	s[444][3]="べん";
	s[444][4]="つや";

	q[445]="反吐";
	s[445][1]="へど";
	s[445][2]="はんど";
	s[445][3]="げど";
	s[445][4]="はとう";

	q[446]="伺った";
	s[446][1]="うかがった";
	s[446][2]="うたがった";
	s[446][3]="たまわった";
	s[446][4]="ちぎった";

	q[447]="免れる";
	s[447][1]="まぬかれる";
	s[447][2]="まねかれる";
	s[447][3]="はなれる";
	s[447][4]="にがれる";

	q[448]="訴え";
	s[448][1]="うったえ";
	s[448][2]="しりぞえ";
	s[448][3]="あらそえ";
	s[448][4]="おしえ";

	q[449]="成就";
	s[449][1]="じょうじゅ";
	s[449][2]="せいじゅう";
	s[449][3]="しょうしゅう";
	s[449][4]="せんじゅ";

	q[450]="掲げる";
	s[450][1]="かかげる";
	s[450][2]="しげる";
	s[450][3]="さまたげる";
	s[450][4]="ひろげる";

	q[451]="細胞";
	s[451][1]="さいぼう";
	s[451][2]="しょうぼう";
	s[451][3]="さいぽう";
	s[451][4]="せいほう";

	q[452]="抜粋";
	s[452][1]="ばっすい";
	s[452][2]="ばんざい";
	s[452][3]="ぬっさい";
	s[452][4]="ゆうすい";


	q[453]   ="爽やか";
	s[453][1]="さわやか";
	s[453][2]="そうやか";
	s[453][3]="まろやか";
	s[453][4]="ひやか";

	q[454]   ="僅か";
	s[454][1]="わずか";
	s[454][2]="わつか";
	s[454][3]="さやか";
	s[454][4]="すこやか";

	q[455]   ="堪能";
	s[455][1]="たんのう";
	s[455][2]="かんのう";
	s[455][3]="ていのう";
	s[455][4]="はんのう";

	q[456]   ="闇";
	s[456][1]="やみ";
	s[456][2]="くらい";
	s[456][3]="おと";
	s[456][4]="えん";

	q[457]   ="是正";
	s[457][1]="ぜせい";
	s[457][2]="じしょう";
	s[457][3]="じせい";
	s[457][4]="せさい";

	q[458]   ="怠らない";
	s[458][1]="おこたらない";
	s[458][2]="すわらない";
	s[458][3]="だるらない";
	s[458][4]="たらない";
	
	
	q[459]   ="迅速";
	s[459][1]="じんそく";
	s[459][2]="じんぞく";
	s[459][3]="しんぞく";
	s[459][4]="しゅんそく";

	q[460]   ="償う";
	s[460][1]="つぐなう";
	s[460][2]="もらう";
	s[460][3]="はらう";
	s[460][4]="あがなう";

	q[461]   ="抜本";
	s[461][1]="ばっぽん";
	s[461][2]="ぬっぽ";
	s[461][3]="ぬきもと";
	s[461][4]="ほうぼん";


	q[462]   ="担って";
	s[462][1]="になって";
	s[462][2]="せおって";
	s[462][3]="なにって";
	s[462][4]="つかって";

	q[463]   ="懸念";
	s[463][1]="けねん";
	s[463][2]="ひねん";
	s[463][3]="けんなん";
	s[463][4]="かんにん";

	q[464]   ="猛暑";
	s[464][1]="もうしょ";
	s[464][2]="もうじょう";
	s[464][3]="もうちょ";
	s[464][4]="もしょう";
	

	q[465]   ="役所";
	s[465][1]="やくしょ";
	s[465][2]="やくじょ";
	s[465][3]="やくしょう";
	s[465][4]="えきしょう";


	q[466]   ="念頭";
	s[466][1]="ねんとう";
	s[466][2]="ねんず";
	s[466][3]="ねんづ";
	s[466][4]="ねんがしら";

	q[467]   ="概説";
	s[467][1]="がいせつ";
	s[467][2]="かいぜつ";
	s[467][3]="かいせつ";
	s[467][4]="がいぜつ";

	q[468]   ="一読";
	s[468][1]="いちどく";
	s[468][2]="いっよみ";
	s[468][3]="いちよみ";
	s[468][4]="いっどく";


	q[469]   ="妊娠";
	s[469][1]="にんしん";
	s[469][2]="しんさん";
	s[469][3]="にんさん";
	s[469][4]="じんしん";

	q[470]   ="解剖";
	s[470][1]="かいぼう";
	s[470][2]="がいぶ";
	s[470][3]="かいぶ";
	s[470][4]="がいぼう";

	q[471]   ="臆病";
	s[471][1]="おくびょう";
	s[471][2]="いくびょう";
	s[471][3]="おくびん";
	s[471][4]="いくびん";


	q[472]   ="対象";
	s[472][1]="たいしょう";
	s[472][2]="ていしょう";
	s[472][3]="たいぞう";
	s[472][4]="だいそう";


	q[473]   ="薬物";
	s[473][1]="やくぶつ";
	s[473][2]="やくぼつ";
	s[473][3]="やっぷつ";
	s[473][4]="やっもつ";

	q[474]   ="防止";
	s[474][1]="ぼうし";
	s[474][2]="ほうし";
	s[474][3]="ぼうじ";
	s[474][4]="ほうじ";

	q[475]   ="伴（った）";
	s[475][1]="ともな";
	s[475][2]="そなわ";
	s[475][3]="つたわ";
	s[475][4]="いっしょ";	
	
	
	return {"question": q, "choice": s};


}